9/data/attachments/ae3013e0f946b3ac.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6e2c9cea-0d10-4338-8b40-66eaf03f2c02</nif:username>
            <nif:friendToBeAdded>Kelsey_series_Friend_44217_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>